SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_cam.c
void CAM_CapturePipe_Start(uint8_t *capture_pipe_dst, uint32_t cam_mode)
{
  int ret;

  ret = CMW_CAMERA_Start(DCMIPP_PIPE1, capture_pipe_dst, cam_mode);
  assert(ret == CMW_ERROR_NONE);
}

void CAM_IspUpdate(void)
{
  int ret;

  ret = CMW_CAMERA_Run();
  assert(ret == CMW_ERROR_NONE);
}

void CAM_Deinit()
{
  int ret;

  ret = CMW_CAMERA_DeInit();
  assert(ret == HAL_OK);
}

void CMW_CAMERA_PIPE_ErrorCallback(uint32_t pipe)
{
  /* FIXME : Need to tune sensor/ipplug so we can remove this implementation */
}

/* ---------- Frame counter for standalone warmup ----------
   The vsync interrupt fires once per captured frame. We count frames
   here so we can discard exactly N warmup frames instead of guessing
   with a time-based delay. */
static volatile uint32_t g_frame_count = 0;
static volatile int      g_wait_frames = 0;  /* target: frames to wait before done */

/**
 * @brief Called from CMW_CAMERA_PIPE_VsyncEventCallback on each frame completion.
 *        Increments the frame counter; when enough frames arrive, sets g_wait_frames = 0. */
void CAM_CountVsyncFrame(void)
{
  if (g_wait_frames > 0) {
    g_frame_count++;
    if (g_frame_count >= (uint32_t)g_wait_frames)
      g_wait_frames = 0;  /* signal: warmup done */
  }
}

/**
 * @brief Reset the frame counter and set the target number of frames to wait.
 *        Call this before starting a standalone capture. */
void CAM_ResetFrameCounter(int wait_frames)
{
  g_frame_count = 0;
  g_wait_frames = wait_frames;
}

/**
 * @brief Get the current frame count (for debugging). */
uint32_t CAM_GetFrameCount(void)
{
  return g_frame_count;
}

static int CAM_WaitFrames(int frame_count, uint32_t timeout_ms, TickType_t poll_ticks)
{
  uint32_t t0 = HAL_GetTick();
  CAM_ResetFrameCounter(frame_count);
  while (g_wait_frames != 0) {
    CAM_IspUpdate();
    vTaskDelay(poll_ticks);
    if (HAL_GetTick() - t0 > timeout_ms) {
      return -1;
    }
  }
  return 0;
}

/**
 * @brief Capture a single frame WITHOUT UVC streaming.
 *
 * Strategy (frame-counted warmup, NOT time-based):
 *   1. Init camera sensor + DCMIPP pipe (YUV422, requested resolution)
 *   2. Start CONTINUOUS capture into buf (each frame overwrites buf)
 *   3. Wait for exactly `warmup_frames + 1' frame completions:
 *      - `warmup_frames' are discarded (sensor stabilization)
 *      - the final frame is kept in buf
 *   4. Stop DCMIPP (buf holds the clean, stabilized frame)
 *   5. Deinit camera (power down sensor + DCMIPP)
 *
 * @param buf            Pre-allocated buffer (≥ width*height*2 bytes)
 * @param buf_size       Size of buf in bytes
 * @param width          Capture width  (e.g. 640)
 * @param height         Capture height (e.g. 480)
 * @param fps            Sensor frame-rate (e.g. 30)
 * @param warmup_frames  Number of frames to discard before keeping one (default: 8)
 * @return 0 on success, -1 on error (timeout)
 */
int CAM_CaptureSingleFrame(uint8_t *buf, int buf_size, int width, int height, int fps, int warmup_frames)
{
  /* ---- sanity checks ---- */
  int min_size = width * height * 2;  /* YUV422 = 2 bpp */

#if PERF_DEBUG_LEVEL >= 2
  printf("[CAM] Enter: %dx%d, min_buf=%d, avail=%d\n", width, height, min_size, buf_size);
#endif

  if (buf == NULL || buf_size <= 0) {
#if PERF_DEBUG_LEVEL >= 1
    printf("[CAM] FAIL: buf NULL or size 0\n");
#endif
    return -1;
  }
  if (buf_size < min_size) {
#if PERF_DEBUG_LEVEL >= 1
    printf("[CAM] FAIL: buffer too small (%d < %d)\n", buf_size, min_size);
#endif
    return -1;
  }
  if (warmup_frames < 1) warmup_frames = 8;

  /* ---- PERF: Mark camera init start ---- */
  PERF_MARK(g_perf_timer, CAM_INIT);

  /* ---- 1. Init camera ---- */
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Init camera %dx%d@%d YUV422 ...\n", width, height, fps);
#endif

  CAM_conf_t conf = {0};
  conf.capture_width        = width;
  conf.capture_height       = height;
  conf.fps                  = fps;
  conf.dcmipp_output_format = DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1;
  conf.is_rgb_swap          = 0;

  CAM_Init(&conf);

  /* ---- PERF: Mark exposure config ---- */
  PERF_MARK(g_perf_timer, CAM_EXPO);

  /* ---- Apply camera quality settings from app_config.h ----
     CRITICAL: Must be AFTER CAM_Init() so sensor defaults don't override */
  int32_t ret_expo_mode;

  ret_expo_mode = CMW_CAMERA_SetExposureMode(
      CAM_EXPOSURE_MODE == 1 ? CMW_EXPOSUREMODE_MANUAL :
      CAM_EXPOSURE_MODE == 2 ? CMW_EXPOSUREMODE_AUTOFREEZE :
                               CMW_EXPOSUREMODE_AUTO);

  if (CAM_EXPOSURE_MODE == 1) {
    int32_t ret_expo = CMW_CAMERA_SetExposure(CAM_EXPOSURE_VALUE);
    int32_t ret_gain = CMW_CAMERA_SetGain(CAM_GAIN_VALUE);

    /* Read back to verify */
    int32_t readback_expo, readback_gain;
    CMW_CAMERA_GetExposure(&readback_expo);
    CMW_CAMERA_GetGain(&readback_gain);

#if PERF_DEBUG_LEVEL >= 2
    printf("[CAM] SetExposure(%ld)->rc=%ld, SetGain(%ld)->rc=%ld\n",
           (long)CAM_EXPOSURE_VALUE, (long)ret_expo,
           (long)CAM_GAIN_VALUE, (long)ret_gain);
    printf("[CAM] Readback: exposure=%ld, gain=%ld\n", (long)readback_expo, (long)readback_gain);
#elif PERF_DEBUG_LEVEL >= 1
    printf("[CAM] Exposure=%ld Gain=%ld (rc=%ld)\n",
           (long)readback_expo, (long)readback_gain, (long)ret_expo);
#endif
  } else {
#if PERF_DEBUG_LEVEL >= 2
    printf("[CAM] SetExposureMode=%ld rc=%ld\n", (long)CAM_EXPOSURE_MODE, (long)ret_expo_mode);
#endif
  }

#if PERF_DEBUG_LEVEL >= 2
  printf("[CAM] Camera init done\n");
#endif

  DCMIPP_HandleTypeDef *hhandle = CMW_CAMERA_GetDCMIPPHandle();

  /* ---- PERF: Mark warmup start ---- */
  PERF_MARK(g_perf_timer, CAM_WARMUP);

  /* Reset frame counter */
  CAM_ResetFrameCounter(warmup_frames + 1);

  /* ---- 2. Start CONTINUOUS capture into buf ---- */
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Start continuous capture (warmup=%d + 1)...\n", warmup_frames);
#endif

  CAM_CapturePipe_Start(buf, CMW_MODE_CONTINUOUS);

#if PERF_DEBUG_LEVEL >= 3
  printf("[CAM] Capture started. Waiting %d frames...\n", warmup_frames + 1);
#endif

  /* ---- 3. Wait for enough frames ---- */
  uint32_t t0 = HAL_GetTick();
  while (g_wait_frames != 0) {
    CAM_IspUpdate();
    vTaskDelay(pdMS_TO_TICKS(5));

