SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_cam.c
    if (HAL_GetTick() - t0 > 5000) {
#if PERF_DEBUG_LEVEL >= 1
      printf("[CAM] TIMEOUT! Got %lu/%d frames in %lu ms\n",
             (unsigned long)g_frame_count, warmup_frames + 1,
             (unsigned long)(HAL_GetTick() - t0));
#endif
      HAL_DCMIPP_PIPE_Stop(hhandle, DCMIPP_PIPE1);
      CAM_Deinit();
      return -1;
    }
  }

#if PERF_DEBUG_LEVEL >= 2
  printf("[CAM] Got %lu frames in %lu ms (~%lu ms/frame)\n",
         (unsigned long)g_frame_count,
         (unsigned long)(HAL_GetTick() - t0),
         g_frame_count > 0 ? (HAL_GetTick() - t0) / g_frame_count : 0);
#endif

  /* ---- PERF: Mark frame captured ---- */
  PERF_MARK(g_perf_timer, CAM_SNAP);

  /* ---- 4. Stop DCMIPP — buf has the clean frame ---- */
  PERF_MARK(g_perf_timer, CAM_STOP);
  HAL_DCMIPP_PIPE_Stop(hhandle, DCMIPP_PIPE1);
  HAL_Delay(5);

  /* ---- 5. Deinit camera ---- */
  PERF_MARK(g_perf_timer, CAM_DEINIT);

#if PERF_DEBUG_LEVEL >= 2
  printf("[CAM] Deinit camera ...\n");
#endif

  CAM_Deinit();

#if PERF_DEBUG_LEVEL >= 3
  printf("[CAM] Done. buf=%p size=%d\n", (void*)buf, min_size);
#endif

  return 0;
}

/* Backward-compatible wrapper with default warmup = 8 frames */
int CAM_CaptureSingleFrame_DefaultWarmup(uint8_t *buf, int buf_size, int width, int height, int fps)
{
  return CAM_CaptureSingleFrame(buf, buf_size, width, height, fps, 8);
}

/**
 * @brief Capture multiple frames with ONE init+warmup+deinit cycle.
 *
 *   Much faster than calling CAM_CaptureSingleFrame N times:
 *     - Single warmup (8 frames discarded once)
 *     - N consecutive frames captured rapidly (~33ms each at 30fps)
 *     - Single deinit at end
 *
 *   Total time: ~1 init + 8 warmup + N capture + 1 deinit ≈ 400ms + N×33ms
 *   vs N×CAM_CaptureSingleFrame: N×(400ms + 8×33ms) ≈ N×664ms
 *
 * @param batch_buf    Pre-allocated buffer ≥ frame_count × frame_size
 * @param frame_size   Size of one frame in bytes
 * @param frame_count  Number of frames to capture (e.g., 3)
 * @param width        Capture width
 * @param height       Capture height
 * @param fps          Sensor frame rate
 * @return number of frames captured (0..frame_count), -1 on error
 */
int CAM_CaptureBatchFrames(uint8_t *batch_buf, int frame_size, int frame_count,
                           int width, int height, int fps)
{
  int min_size = width * height * 2;  /* YUV422 = 2 bpp */
  if (batch_buf == NULL || frame_size < min_size || frame_count < 1) return -1;

  /* 1. Init camera */
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Batch init %dx%d@%d YUV422 (%d frames)...\n", width, height, fps, frame_count);
#endif

  CAM_conf_t conf = {0};
  conf.capture_width = width;
  conf.capture_height = height;
  conf.fps = fps;
  conf.dcmipp_output_format = DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1;
  conf.is_rgb_swap = 0;
  CAM_Init(&conf);

  /* 2. Apply exposure */
  CMW_CAMERA_SetExposureMode(CMW_EXPOSUREMODE_MANUAL);
  CMW_CAMERA_SetExposure(CAM_EXPOSURE_VALUE);
  CMW_CAMERA_SetGain(CAM_GAIN_VALUE);

  DCMIPP_HandleTypeDef *hhandle = CMW_CAMERA_GetDCMIPPHandle();

   /* 3. Start continuous capture */
   CAM_CapturePipe_Start(capture_buf, CMW_MODE_CONTINUOUS);

  /* Re-apply exposure after start */
  if (CAM_EXPOSURE_MODE == 1) {
      CMW_CAMERA_SetExposure(CAM_EXPOSURE_VALUE);
      CMW_CAMERA_SetGain(CAM_GAIN_VALUE);
      CAM_IspUpdate();
  }

  /* 4. Warmup: discard SNAP_WARMUP_FRAMES */
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Warmup: discarding %d frames...\n", SNAP_WARMUP_FRAMES);
#endif
  CAM_ResetFrameCounter(SNAP_WARMUP_FRAMES);
  uint32_t t0 = HAL_GetTick();
  while (g_wait_frames != 0) {
    CAM_IspUpdate();
    vTaskDelay(pdMS_TO_TICKS(5));
    if (HAL_GetTick() - t0 > 5000) {
#if PERF_DEBUG_LEVEL >= 1
      printf("[CAM] WARMUP TIMEOUT!\n");
#endif
      HAL_DCMIPP_PIPE_Stop(hhandle, DCMIPP_PIPE1);
      CAM_Deinit();
      return -1;
    }
  }

  /* 5. Capture frame_count frames */
  int captured = 0;
  for (int i = 0; i < frame_count; i++) {
    /* Wait for one frame */
    CAM_ResetFrameCounter(1);
    t0 = HAL_GetTick();
    while (g_wait_frames != 0) {
      CAM_IspUpdate();
      vTaskDelay(pdMS_TO_TICKS(5));
      if (HAL_GetTick() - t0 > 500) break;
    }

    /* Copy to batch buffer */
    uint8_t *dest = batch_buf + (i * frame_size);
    SCB_InvalidateDCache_by_Addr((uint32_t *)capture_buf, frame_size);
    memcpy(dest, capture_buf, frame_size);
    SCB_CleanDCache_by_Addr((uint32_t *)dest, frame_size);
    captured++;
  }

  /* 6. Stop and deinit */
  HAL_DCMIPP_PIPE_Stop(hhandle, DCMIPP_PIPE1);
  CAM_Deinit();

#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Batch: %d/%d frames in %lu ms\n", captured, frame_count,
         (unsigned long)(HAL_GetTick() - t0));
#endif

  return captured;
}

/* ================================================================
   CONTINUOUS MODE IMPLEMENTATION (CAPTURE_MODE = 1)
   ================================================================ */

/**
 * @brief  Internal helper: Init camera + apply quality settings + warmup.
 *
 *   Shared between CAM_CaptureSingleFrame (on-demand) and
 *   CAM_ContinuousStart (continuous).  This function performs the
 *   sensor init, exposure/gain configuration, warmup discard, and
 *   leaves the capture pipe RUNNING in continuous mode.
 *
 * @param  buf            Pre-allocated buffer for capture
 * @param  buf_size       Size of buf in bytes
 * @param  width          Capture width
 * @param  height         Capture height
 * @param  fps            Sensor frame rate
 * @param  warmup_frames  Number of frames to discard (use 0 to skip warmup)
 * @return 0 on success, -1 on error
 */
static int CAM_InitAndStartContinuous(uint8_t *buf, int buf_size,
                                       int width, int height, int fps,
                                       int warmup_frames)
{
  int min_size = width * height * 2;

  if (buf == NULL || buf_size <= 0) return -1;
  if (buf_size < min_size) return -1;
  if (warmup_frames < 0) warmup_frames = 0;

  /* ---- 1. Init camera ---- */
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Init camera %dx%d@%d YUV422 ...\n", width, height, fps);
#endif

  CAM_conf_t conf = {0};
  conf.capture_width        = width;
  conf.capture_height       = height;
  conf.fps                  = fps;
  conf.dcmipp_output_format = DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1;
  conf.is_rgb_swap          = 0;

  CAM_Init(&conf);

