SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_cam.c
  /* ---- Apply camera quality settings ---- */
  int32_t ret_expo_mode;
  ret_expo_mode = CMW_CAMERA_SetExposureMode(
      CAM_EXPOSURE_MODE == 1 ? CMW_EXPOSUREMODE_MANUAL :
      CAM_EXPOSURE_MODE == 2 ? CMW_EXPOSUREMODE_AUTOFREEZE :
                               CMW_EXPOSUREMODE_AUTO);

  if (CAM_EXPOSURE_MODE == 1) {
    int32_t ret_expo = CMW_CAMERA_SetExposure(CAM_EXPOSURE_VALUE);
    int32_t ret_gain = CMW_CAMERA_SetGain(CAM_GAIN_VALUE);

    int32_t readback_expo, readback_gain;
    CMW_CAMERA_GetExposure(&readback_expo);
    CMW_CAMERA_GetGain(&readback_gain);

#if PERF_DEBUG_LEVEL >= 2
    printf("[CAM] SetExposure(%ld)->rc=%ld, SetGain(%ld)->rc=%ld\n",
           (long)CAM_EXPOSURE_VALUE, (long)ret_expo,
           (long)CAM_GAIN_VALUE, (long)ret_gain);
    printf("[CAM] Readback: exposure=%ld, gain=%ld\n", (long)readback_expo, (long)readback_gain);
#endif
  } else {
#if PERF_DEBUG_LEVEL >= 2
    printf("[CAM] SetExposureMode=%ld rc=%ld\n", (long)CAM_EXPOSURE_MODE, (long)ret_expo_mode);
#endif
  }

  DCMIPP_HandleTypeDef *hhandle = CMW_CAMERA_GetDCMIPPHandle();

  /* ---- 2. Start CONTINUOUS capture into buf ---- */
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Start continuous capture ...\n");
#endif

  CAM_CapturePipe_Start(buf, CMW_MODE_CONTINUOUS);

  /* ---- CRITICAL: Re-apply manual exposure AFTER ISP starts ----
     The ISP library's auto-exposure engine may overwrite sensor exposure
     during ISP_Start() / CAM_IspUpdate(). For MANUAL mode, we must force
     the exposure value again after the camera pipe is running. */
  if (CAM_EXPOSURE_MODE == 1) {
    int32_t ret_expo2 = CMW_CAMERA_SetExposure(CAM_EXPOSURE_VALUE);
    int32_t ret_gain2 = CMW_CAMERA_SetGain(CAM_GAIN_VALUE);

    /* Force ISP to process the new values */
    CAM_IspUpdate();

    int32_t readback_expo2, readback_gain2;
    CMW_CAMERA_GetExposure(&readback_expo2);
    CMW_CAMERA_GetGain(&readback_gain2);

#if PERF_DEBUG_LEVEL >= 1
    printf("[CAM] Post-start exposure=%ld, gain=%ld (rc=%ld,%ld)\n",
           (long)readback_expo2, (long)readback_gain2, (long)ret_expo2, (long)ret_gain2);
#endif
  }

  /* ---- 3. Wait for warmup frames (if requested) ---- */
  if (warmup_frames > 0) {
#if PERF_DEBUG_LEVEL >= 1
    printf("[CAM] Warmup: discarding %d frames...\n", warmup_frames);
#endif
    CAM_ResetFrameCounter(warmup_frames);

    uint32_t t0 = HAL_GetTick();
    while (g_wait_frames != 0) {
      CAM_IspUpdate();
      vTaskDelay(pdMS_TO_TICKS(5));

      if (HAL_GetTick() - t0 > 5000) {
#if PERF_DEBUG_LEVEL >= 1
        printf("[CAM] WARMUP TIMEOUT! Got %lu/%d frames\n",
               (unsigned long)g_frame_count, warmup_frames);
#endif
        HAL_DCMIPP_PIPE_Stop(hhandle, DCMIPP_PIPE1);
        CAM_Deinit();
        return -1;
      }
    }
#if PERF_DEBUG_LEVEL >= 1
    printf("[CAM] Warmup done (%lu frames). Camera RUNNING.\n",
           (unsigned long)g_frame_count);
#endif
  } else {
#if PERF_DEBUG_LEVEL >= 1
    printf("[CAM] No warmup. Camera RUNNING.\n");
#endif
  }

  return 0;
}

/**
 * @brief  Start continuous camera capture (init + warmup done once at boot).
 *
 *   After this call the camera pipe is running in CONTINUOUS mode,
 *   constantly overwriting `buf` with fresh frames.  Use
 *   CAM_ContinuousSnap() to safely extract a frame on demand.
 *
 * @return 0 on success, -1 on timeout or buffer too small
 */
int CAM_ContinuousStart(uint8_t *buf, int buf_size, int width, int height, int fps)
{
  return CAM_InitAndStartContinuous(buf, buf_size, width, height, fps, SNAP_WARMUP_FRAMES);
}

/**
 * @brief  Snap the current frame from the continuous capture buffer.
 *
 *   Strategy (FIXED for torn-frame glitch):
 *     1. STOP the DCMIPP pipe briefly (halts sensor → DMA → capture_buf)
 *     2. Invalidate D-Cache for capture_buf (read fresh DMA data)
 *     3. memcpy capture_buf → dest_buf (guaranteed clean frame, no tearing)
 *     4. Clean D-Cache for dest_buf (SD write sees it)
 *     5. RESTART the DCMIPP pipe (continuous capture resumes)
 *
 *   At 30 FPS, one frame period ≈ 33ms. Stopping for ~5ms copy is only
 *   ~15% of a frame period — the sensor simply drops 0-1 frames during
 *   the copy, which is imperceptible.
 *
 *   This eliminates the "row jump"/glitch artifact caused by DCMIPP
 *   overwriting capture_buf rows while we're reading them.
 *
 * @return 0 on success, -1 on error
 */
int CAM_ContinuousSnap(uint8_t *dest_buf, uint32_t frame_size)
{
    if (!dest_buf) return -1;

    uint32_t t0 = HAL_GetTick();

    DCMIPP_HandleTypeDef *hhandle = CMW_CAMERA_GetDCMIPPHandle();

    /* Wait for NEXT frame after trigger so we never store a stale frame. */
    if (CAM_WaitFrames(1, 200, pdMS_TO_TICKS(2)) != 0) {
        return -1;
    }

    /* --- Step 1: STOP DCMIPP pipe to prevent torn frames --- */
    HAL_DCMIPP_PIPE_Stop(hhandle, DCMIPP_PIPE1);

    /* Small delay to ensure DCMIPP has fully stopped and DMA is idle */
    for (volatile int i = 0; i < 100; i++);

    /* --- Step 2: D-Cache coherency --- */
    SCB_InvalidateDCache_by_Addr((uint32_t *)capture_buf, frame_size);

    /* --- Step 3: memcpy — guaranteed no tearing since pipe is stopped --- */
    memcpy(dest_buf, capture_buf, frame_size);

    /* --- Step 4: Clean destination — push CPU-written data to PSRAM for SD DMA --- */
    SCB_CleanDCache_by_Addr((uint32_t *)dest_buf, frame_size);

    /* --- Step 5: RESTART the DCMIPP pipe --- */
    CMW_CAMERA_Start(DCMIPP_PIPE1, capture_buf, CMW_MODE_CONTINUOUS);

    uint32_t elapsed = HAL_GetTick() - t0;

#if PERF_DEBUG_LEVEL >= 1
    printf("[CAM] ContinuousSnap: stop+copy+restart in %lu ms\n", (unsigned long)elapsed);
#endif

    return 0;
}

/**
 * @brief  Stop continuous capture and deinit camera (shutdown).
 */
int CAM_ContinuousStop(void)
{
  DCMIPP_HandleTypeDef *hhandle = CMW_CAMERA_GetDCMIPPHandle();
  if (hhandle) {
    HAL_DCMIPP_PIPE_Stop(hhandle, DCMIPP_PIPE1);
  }
  CAM_Deinit();
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Continuous mode stopped.\n");
#endif
  return 0;
}

/* ================================================================
   BATCH CAPTURE MODE (CAPTURE_MODE = 2)
   ================================================================ */

/**
 * @brief  Capture BATCH_FRAMES quickly from continuous camera into batch_buf.
 *
 *   Strategy:
 *     The camera is running in CONTINUOUS mode, overwriting capture_buf.
 *     On each grab:
 *       1. STOP pipe
 *       2. Invalidate D-Cache for capture_buf
 *       3. memcpy capture_buf → batch_buf[frame_index * frame_size]
 *       4. RESTART pipe (immediately, next frame arrives ~33ms at 30FPS)
 *       5. Wait for 1 new frame to complete (poll g_frame_count)
 *       6. Repeat for BATCH_FRAMES
 *
 *   Total grab time: BATCH_FRAMES × (~33ms + copy_time) ≈ 3 × 38ms = 114ms
 *   LEDs stay ON during this entire window.
 *
 * @param  batch_buf    Pre-allocated buffer ≥ BATCH_FRAMES × frame_size
 * @param  frame_size   Size of one frame in bytes
 * @return number of frames successfully captured (0..BATCH_FRAMES), -1 on error
 */
int CAM_ContinuousBatchSnap(uint8_t *batch_buf, uint32_t frame_size)
{
#if CAPTURE_MODE != 2
    (void)batch_buf; (void)frame_size;
    return -1;
#endif
    if (!batch_buf) return -1;

    DCMIPP_HandleTypeDef *hhandle = CMW_CAMERA_GetDCMIPPHandle();
    if (!hhandle) return -1;

