SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_cam.c
    uint32_t t0 = HAL_GetTick();
    uint8_t frames_captured = 0;

#if PERF_DEBUG_LEVEL >= 1
    printf("[CAM] BatchSnap: grabbing %d frames...\n", BATCH_FRAMES);
#endif

    /* Ensure first copied frame is fresh after trigger. */
    if (CAM_WaitFrames(1, 200, pdMS_TO_TICKS(2)) != 0) {
        return -1;
    }

    for (uint8_t i = 0; i < BATCH_FRAMES; i++) {
        uint8_t *dest = batch_buf + (i * frame_size);

        /* --- Step 1: STOP DCMIPP pipe --- */
        HAL_DCMIPP_PIPE_Stop(hhandle, DCMIPP_PIPE1);
        for (volatile int d = 0; d < 100; d++);

        /* --- Step 2: Invalidate D-Cache (read fresh DMA data) --- */
        SCB_InvalidateDCache_by_Addr((uint32_t *)capture_buf, frame_size);

        /* --- Step 3: memcpy capture_buf → batch slot --- */
        memcpy(dest, capture_buf, frame_size);

        /* --- Step 4: Clean destination for SD DMA later --- */
        SCB_CleanDCache_by_Addr((uint32_t *)dest, frame_size);

        /* --- Step 5: RESTART pipe immediately --- */
        CMW_CAMERA_Start(DCMIPP_PIPE1, capture_buf, CMW_MODE_CONTINUOUS);

        frames_captured++;

        /* --- Step 6: Wait for 1 new frame before next grab (except last) --- */
        if (i < BATCH_FRAMES - 1) {
            if (CAM_WaitFrames(1, 200, pdMS_TO_TICKS(2)) != 0) {
                break;
            }
        }
    }

    uint32_t elapsed = HAL_GetTick() - t0;

#if PERF_DEBUG_LEVEL >= 1
    printf("[CAM] BatchSnap: %d frames in %lu ms (%lu ms/frame)\n",
           (unsigned long)frames_captured,
           (unsigned long)elapsed,
           frames_captured > 0 ? elapsed / frames_captured : 0);
#endif

    return (int)frames_captured;
}
